Revit 2026 API

# ClosestPointsPairBetweenTwoCurvesDistance Property

---

Distance from point on first curve to the point on second curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Distance { get; set; }
```
```vb
Public Property Distance As Double
	Get
	Set
```
```cpp
public:
property double Distance {
	double get ();
	void set (double value);
}
```
```fsharp
member Distance : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The property has not been set by the method providing the result. |

#### Reference

ClosestPointsPairBetweenTwoCurves Class

Autodesk.Revit.DB Namespace